TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_УстановкаНастроекГруппировкиПоЛотам/гкс_УстановкаНастроекГруппировкиПоЛотам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_УстановкаНастроекГруппировкиПоЛотам</name>
  <registerRecords>InformationRegister.гкс_НастройкиГруппировкиПоЛотам</registerRecords>
  <attributes>
    <name>ТочкаМаршрута</name>
    <type>
      <types>CatalogRef.гкс_ТочкиМаршрута</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиГруппировки</name>
    <attributes>
      <name>ОбъемГрузаОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемГрузаДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемЛота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

TransportManagementDevelop_KAT/Конфигурация/src/Documents/гкс_УстановкаНастроекГруппировкиПоЛотам/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьЗаполнениеНастроекГруппировки(Отказ);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыНастройкиГруппировки

&НаКлиенте
Процедура НастройкиГруппировкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.НастройкиГруппировки.ТекущиеДанные;
		КоличествоСтрок = Объект.НастройкиГруппировки.Количество();
		Смещение = 2;
		Если КоличествоСтрок < Смещение Тогда
			ОбъемГрузаОт = 1;
		Иначе
			ИндексСтроки = КоличествоСтрок - Смещение;
			ОбъемГрузаОт = Объект.НастройкиГруппировки[ИндексСтроки].ОбъемГрузаДо + 1;
		КонецЕсли;
		
		ТекущиеДанные.ОбъемГрузаОт = ОбъемГрузаОт;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьЗаполнениеНастроекГруппировки(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкиГруппировкиПоЛотам", Объект.НастройкиГруппировки.Выгрузить());
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиГруппировкиПоЛотам.НомерСтроки КАК НомерСтроки,
	|	НастройкиГруппировкиПоЛотам.ОбъемГрузаОт КАК ОбъемГрузаОт,
	|	НастройкиГруппировкиПоЛотам.ОбъемГрузаДо КАК ОбъемГрузаДо
	|ПОМЕСТИТЬ НастройкиГруппировкиПоЛотам
	|ИЗ
	|	&НастройкиГруппировкиПоЛотам КАК НастройкиГруппировкиПоЛотам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиГруппировкиПоЛотам.НомерСтроки КАК НомерСтроки,
	|	НастройкиГруппировкиПоЛотамПредыдущий.ОбъемГрузаДо + 1 КАК ОбъемГрузаДоОжидаемый
	|ИЗ
	|	НастройкиГруппировкиПоЛотам КАК НастройкиГруппировкиПоЛотам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НастройкиГруппировкиПоЛотам КАК НастройкиГруппировкиПоЛотамПредыдущий
	|		ПО НастройкиГруппировкиПоЛотам.НомерСтроки - 1 = НастройкиГруппировкиПоЛотамПредыдущий.НомерСтроки
	|ГДЕ
	|	НЕ НастройкиГруппировкиПоЛотам.ОбъемГрузаОт = НастройкиГруппировкиПоЛотамПредыдущий.ОбъемГрузаДо + 1";
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	СтрокиСообщения = Новый Массив;
	СтрокиСообщения.Добавить(НСтр("ru = 'Настройки группировки заданы не верно!'"));
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокиСообщения.Добавить(
			СтрШаблон(НСтр("ru = 'В строке %1 Объем груза от должен равняться %2'"), 
				Выборка.НомерСтроки, Выборка.ОбъемГрузаДоОжидаемый));
	КонецЦикла;
	
	ТекстСообщения = СтрСоединить(СтрокиСообщения, Символы.ПС);
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , , , Отказ);
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
